<template>
  <div>
    <div class="back-country">
      <div class="header-content">
        <h1>Правовые<br v-if="isMobile"/> документы</h1>
        <button class="back-btn" @click="router.back()">← Назад</button>
      </div>
    </div>
    <div class="info">
      <div v-for="arr in arrInformation">
        <div class="info-loyar">
          <h2 class="loyar-header">{{ arr.header }}</h2>
          <div class="loyar-info" v-if="arr.id === 1" v-html="arr.text"></div>
          <div class="loyar-info" v-if="arr.id === 2" v-html="arr.text"></div>
        </div>
      </div>
    </div>
  </div>
</template>
<script setup>
import {useRouter} from "#app";
import {computed, onMounted, ref} from "vue";

defineOptions({
  name: "loyarInformation"
})

const router = useRouter()

const arrInformation = [
  {
    id: 1,
    header: 'Согласие на обработку и использование персональных данных',
    text: 'Настоящим я, являясь Заказчиком туристских услуг, входящих в состав туристского продукта, и уполномоченным представителем лиц (туристов), указанных в договоре и приложениях к нему, даю согласие Агенту и его уполномоченным представителям на обработку моих данных и данных лиц (туристов), содержащихся в Заявке: фамилия, имя, отчество, дата и место рождения, пол, гражданство, серия, номер паспорта, иные данные, указанные в паспорте; адрес проживания и регистрации; домашний и мобильный телефон; адрес электронной почты; а также любых иных данных, относящихся к моей личности и личности лиц, указанных в Заявке, в объёме необходимом для реализации и предоставления туристских услуг, в том числе входящих в состав туристского продукта, сформированного Туроператором, на любое действие (операцию) или совокупность действий (операций), совершаемых с моими персональными данными и данными лиц, указанных в Заявке, включая (без ограничений) сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, обезличивание, блокирование, удаление, уничтожение персональных данных, а также осуществление любых других действий, предусмотренных действующим законодательством Российской Федерации, с использованием средств автоматизации, в том числе в информационно-телекоммуникационных сетях, или без использования таких средств, если обработка персональных данных без использования таких средств соответствует характеру действий (операций), совершаемых с персональными данными с использованием средств автоматизации, то есть позволяет осуществлять в соответствии с заданным алгоритмом поиск персональных данных, зафиксированных на материальном носителе и содержащихся в картотеках или иных систематизированных собраниях персональных данных, и/или доступ к таким персональным данным.\n' +
        '<br/>Обработка персональных данных осуществляется Агентом, Туроператором и непосредственными исполнителями услуг в целях заключения и исполнения настоящего договора (в том числе, в зависимости от условий договора – в целях оформления проездных документов, бронирования номеров в средствах размещения и у перевозчиков, передачи данных в консульство иностранного государства, разрешения претензионных вопросов при их возникновении, в том числе в случае инициирования судебных процессов, связанных с исполнением настоящего Договора, предоставления информации уполномоченным государственным органам (в том числе по запросу судов и органов внутренних дел)).\n' +
        '<br/>Я даю согласие на передачу сведений, полученных в ходе исполнения настоящего договора, в установленном законом порядке в единую информационную систему электронных путевок.\n' +
        '<br/>Настоящим я подтверждаю, что переданные мной Агенту персональные данные являются достоверными и могут обрабатываться Агентом и его уполномоченными представителями.\n' +
        '<br/>Настоящим я подтверждаю наличие у меня полномочий на предоставление персональных данных лиц, указанных в Заявке, и принимаю на себя обязательство возместить Агенту любые расходы, связанные с отсутствием у меня соответствующих полномочий, в том числе убытки, связанные с санкциями проверяющих органов.\n' +
        ' \n' +
        '<br/><br/>Я согласен (на) с тем, что текст данного мной по собственной воле, в моих интересах и в интересах лиц, указанных в Заявке, согласия на обработку персональных данных хранится в электронном виде в базе данных и/или на бумажном носителе и подтверждает факт согласия на обработку персональных данных в соответствии с вышеизложенными положениями, и беру на себя ответственность за достоверность предоставления персональных данных.\n' +
        '<br/>Настоящее согласие дается на срок действия настоящего договора и продолжает действовать в течение 5 (пять) лет с момента прекращения действия настоящего Договора и может быть в любой момент отозвано мной, а в части, касающейся конкретного лица, субъекта персональных данных, указанного в Заявке, указанным лицом, путем направления письменного заявления в адрес Агента и Туроператора по почте.\n' +
        '<br/>Адрес Агента и Туроператора указан в настоящем договоре и приложениях к нему.\n' +
        '<br/>Настоящим я подтверждаю, что мои права, как субъекта персональных данных, мне разъяснены Агентом и мне понятны.\n' +
        '<br/>Настоящим я подтверждаю, что порядок и последствия отзыва настоящего согласия мне разъяснены Агентом и мне понятны.\n' +
        ' \n' +
        '<br/><br/>Настоящим я даю свое согласие Агенту и Туроператору направлять мне электронные письма/информационные или рекламные сообщения на указанный мной адрес электронной почты и/или номер мобильного телефона, а также даю согласие на обработку своих персональных данных в указанных целях. Данное согласие я даю по своей воле, осознанно и без принуждения.\n' +
        'При заключении договора я проинформирован о своем праве отказаться от получения указанной информации.'
  },
  {
    id: 2,
    header: 'Согласие на распространение персональных данных',
    text: 'Настоящим я, являясь Заказчиком туристских услуг, входящих в состав туристского продукта, и уполномоченным представителем лиц (туристов), указанных в договоре и приложениях к нему, даю согласие Агенту на распространение (передачу, предоставление, доступ) моих персональных данных и данных лиц, содержащихся в Заявке, в целях исполнения настоящего договора, а также при размещении моего отзыва на официальном сайте Агента или в социальных сетях Агента. Доступ к моим персональным данным и данным лиц, указанных в Заявке, разрешён неограниченному кругу лиц. Распространяемые данные: фамилия, имя, отчество, город проживания, цветное цифровое фотографическое изображение, контактные данные, а также иные данные, распространение которых необходимо для достижения целей обработки персональных данных. Сведения об информационных ресурсах, посредством которых будут осуществляться предоставление доступа неограниченному кругу лиц и иные действия с персональными данными субъекта персональных данных: сайт Агента и социальные сети Агента. Фамилия имя и отчество, контактная информация субъектов персональных данных, сведения об операторе персональных данных, о его сайте в сети Интернет указаны в договоре.\n' +
        '<br/>В целях исполнения Агентом обязательств, предусмотренных настоящим договором, выражаю согласие на трансграничную передачу моих персональных данных в соответствии с Федеральным законом № 152-ФЗ «О персональных данных» от 27.07.2006 г.\n' +
        '<br/><br/>Перечень персональных данных, на трансграничную передачу которых даётся настоящее согласие:<br/><br/>' +
        "<div style='margin-left: 40px'><ul>" +
        '<li>фамилия, имя, отчество (при наличии) заказчика (туриста) на русском языке</li>' +
        '<li>фамилия, имя в латинской транскрипции, как они указаны в заграничном паспорте</li>' +
        '<li>год, месяц и число рождения</li>' +
        '<li>гражданство в настоящее время (при необходимости – гражданство при рождении)</li>' +
        '<li>пол</li>' +
        '<li>данные о заграничном паспорте РФ (серия и номер заграничного паспорта, дата его выдачи, наименование органа, выдавшего паспорт, срок действия)</li>' +
        '<li>данные свидетельства о рождении (для несовершеннолетних граждан)</li>' +
        '<li>адрес электронной почты</li>' +
        '<li>контактный (мобильный) телефон</li>' +
        '<li>другие персональные данные, необходимые для бронирования и предоставления туристских услуг, входящих в состав туристского продукта</li>' +
        '</ul></div>' +
        '\n' +
        '<br/><br/>Настоящее согласие дается на срок действия настоящего договора и продолжает действовать в течение 5 (пять) лет с момента прекращения действия настоящего Договора и может быть в любой момент отозвано мной, а в части, касающейся конкретного лица, субъекта персональных данных, указанного в Заявке, указанным лицом, путем направления письменного заявления в адрес Агента и Туроператора по почте'
  },
]

const windowWidth = ref(0)

const updateWindowWidth = () => {
  if (typeof window !== 'undefined') {
    windowWidth.value = window.innerWidth
    console.log('Window width:', windowWidth.value, 'isMobile:', isMobile.value)
  }
}

const isMobile = computed(() => {

  if (typeof window === 'undefined') {
    return false
  }
  return windowWidth.value <= 576 && windowWidth.value > 0
})

onMounted(() => {
  if (typeof window !== 'undefined') {
    windowWidth.value = window.innerWidth
  }

  updateWindowWidth()
  if (typeof window !== 'undefined') {
    window.addEventListener('resize', updateWindowWidth)
  }
})


</script>
<style scoped lang="scss">
.info {
  display: flex;
  flex-direction: column;
  gap: 140px;
  margin-bottom: 140px;
  @media (max-width: 576px) {
    gap: 40px;
    margin-bottom: 40px;
  }
}

.info-loyar {
  display: flex;
  flex-direction: column;
  gap: 30px;
  @media (max-width: 576px) {
    gap: 10px;
  }
}

.back-country {
  height: 245px;
  width: 100vw;
  position: relative;
  left: 50%;
  right: 50%;
  margin-left: -50vw;
  margin-right: -50vw;
  @media (max-width: 576px) {
    height: 82px;
  }
}

.back-btn {
  background: none;
  border: none;
  color: #C75454;
  font-size: 28px;
  font-weight: bold;
  cursor: pointer;
  margin-top: 8px;
  position: relative;
  right: 10%;
  @media (max-width: 576px) {
    font-size: 12px;
    margin-top: 0;
  }
}

.header-content {
  position: relative;
  z-index: 2;
  display: flex;
  justify-content: space-between;
  align-items: flex-start;
  height: 100%;
  padding: 40px 0px 83px 187px;
  @media (max-width: 576px) {
    height: 82px;
    padding: 20px 5% 40px;
  }
}

.header-content h1 {
  @media (min-width: 768px) {
    //font-size: 64px;
    //font-weight: bold;
    //color: #222;
    margin: 0;
    //left: 7.4%;
    position: relative;
    bottom: -38%;
  }
}

.loyar-info ul {
  margin: 24px 0 24px 64px;
  padding: 0;
}

.loyar-info {
  font-size: 17px;
  margin-bottom: 12px;
  @media (max-width: 576px) {
    font-size: 8px;
  }
}

.loyar-info ul li {
  color: #222;
  text-decoration: none;
  font-size: 17px;
  margin-bottom: 12px;
  line-height: 1.6;
  list-style-type: disc;
  margin-left: 0;
  @media (max-width: 576px) {
    font-size: 8px;
  }
}
</style>